app/Models/ModelCategory.php

SELECT *
FROM `tbl_category`
---
    public function Alldata()
    {
        return $this->db->table('tbl_category')
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `tbl_category`
---
    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_category`
---
    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();