app/Models/ModelProduct.php

    public function Alldata()
    {
        return $this->db->table('tbl_product')
            ->join('tbl_category','tbl_category.id_category=tbl_product.id_category')
            ->join('tbl_unit','tbl_unit.id_unit=tbl_product.id_unit')
            ->orderBy('id_product','Decs')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_product`
JOIN `tbl_category` ON `tbl_category`.`id_category`=`tbl_product`.`id_category`
JOIN `tbl_unit` ON `tbl_unit`.`id_unit`=`tbl_product`.`id_unit`
ORDER BY `id_product`