app/Models/ModelUnit.php

    public function Alldata()
    {
        return $this->db->table('tbl_unit')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tbl_unit`