app/Models/ModelAdmin.php

    public function chart()
    {
        return $this->db->table("tbl_detail_sell")
        ->join('tbl_sell','tbl_sell.no_code=tbl_detail_sell.no_code')
        ->where('month(tbl_sell.date_sell)', date('m'))
        ->where('year(tbl_sell.date_sell)', date('Y'))
        ->select('tbl_sell.date_sell')
        ->groupBy('tbl_detail_sell.code_product')
        ->selectSum('tbl_detail_sell.total_price')
        ->selectSum('tbl_detail_sell.profit')
        ->get()->getResultArray();
---
SELECT `tbl_sell`.`date_sell`, SUM(`tbl_detail_sell`.`total_price`) AS `total_price`, SUM(`tbl_detail_sell`.`profit`) AS `profit`
FROM `tbl_detail_sell`
JOIN `tbl_sell` ON `tbl_sell`.`no_code`=`tbl_detail_sell`.`no_code`
WHERE month(tbl_sell.date_sell) = '10'
AND year(tbl_sell.date_sell) = '2022'
GROUP BY `tbl_detail_sell`.`code_product`

    public function IncomeToday()
    {
        return $this->db->table("tbl_detail_sell")
        ->join('tbl_sell','tbl_sell.no_code=tbl_detail_sell.no_code')
        ->where('tbl_sell.date_sell', date('Y-m-d'))
        ->groupBy('tbl_sell.date_sell')
        ->selectSum('tbl_detail_sell.total_price')
        ->get()->getRowArray();
---
SELECT SUM(`tbl_detail_sell`.`total_price`) AS `total_price`
FROM `tbl_detail_sell`
JOIN `tbl_sell` ON `tbl_sell`.`no_code`=`tbl_detail_sell`.`no_code`
WHERE `tbl_sell`.`date_sell` = '2022-10-09'
GROUP BY `tbl_sell`.`date_sell`

    public function IncomeMonth()
    {
        return $this->db->table("tbl_detail_sell")
        ->join('tbl_sell','tbl_sell.no_code=tbl_detail_sell.no_code')
        ->where('month(tbl_sell.date_sell)', date('m'))
        ->where('year(tbl_sell.date_sell)', date('Y'))
        ->groupBy('month(tbl_sell.date_sell)')
        ->selectSum('tbl_detail_sell.total_price')
        ->get()->getRowArray();
---
SELECT SUM(`tbl_detail_sell`.`total_price`) AS `total_price`
FROM `tbl_detail_sell`
JOIN `tbl_sell` ON `tbl_sell`.`no_code`=`tbl_detail_sell`.`no_code`
WHERE month(tbl_sell.date_sell) = '10'
AND year(tbl_sell.date_sell) = '2022'
GROUP BY month(tbl_sell.date_sell)

    public function IncomeYear()
    {
        return $this->db->table("tbl_detail_sell")
        ->join('tbl_sell','tbl_sell.no_code=tbl_detail_sell.no_code')
        ->where('year(tbl_sell.date_sell)', date('Y'))
        ->groupBy('year(tbl_sell.date_sell)')
        ->selectSum('tbl_detail_sell.total_price')
        ->get()->getRowArray();
---
SELECT SUM(`tbl_detail_sell`.`total_price`) AS `total_price`
FROM `tbl_detail_sell`
JOIN `tbl_sell` ON `tbl_sell`.`no_code`=`tbl_detail_sell`.`no_code`
WHERE year(tbl_sell.date_sell) = '2022'
GROUP BY year(tbl_sell.date_sell)

    public function TotalProduct()
    {
        return $this->db->table('tbl_product')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_product`

    public function TotalCategory()
    {
        return $this->db->table('tbl_category')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_category`

    public function TotalUnit()
    {
        return $this->db->table('tbl_unit')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_unit`

    public function TotalUser()
    {
        return $this->db->table('tbl_user')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `tbl_user`