app/Models/ModelSell.php

SELECT *
FROM `tbl_product`
JOIN `tbl_category` ON `tbl_category`.`id_category`=`tbl_product`.`id_category`
JOIN `tbl_unit` ON `tbl_unit`.`id_unit`=`tbl_product`.`id_unit`
WHERE `stock` >0
ORDER BY `id_product` DESC
---
    public function AllProduct()
    {
        return $this->db->table('tbl_product')
            ->join('tbl_category','tbl_category.id_category=tbl_product.id_category')
            ->join('tbl_unit','tbl_unit.id_unit=tbl_product.id_unit')
            ->orderBy('id_product', 'DESC')
            ->where('stock > 0')
            ->get()
            ->getResultArray();