app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
---
    public function Alldata()
    {
        return $this->db->table('tbl_user')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_user`
WHERE `email` = 'entwo@gmail.com'
AND `password` = 'password123'
---
    public function LoginUser($email, $password) {
        return $this->db->table('tbl_user')
        ->where([
            'email' => $email,
            'password' => $password
        ])->get()->getRowArray();